<a href="https://colab.research.google.com/github/sleeptiger/Abc-project/blob/main/pandas%EC%A0%95%EB%A6%ACL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# PANDAS

## pandas 실행

In [1]:
import numpy as np
import pandas as pd

## 리스트(list)로 pandas 만들기
- 비추천 , columns 따로 지정

In [ ]:
mylist = [1,2,3,4]
print(type(mylist))
mySeries = pd.Series(mylist)

In [ ]:
type(mySeries)

In [ ]:
mylists = [['야구', '류현진', '22,300,000,000'],
           ['축구', '손흥민', '15,000,000,000'],
           ['롤', '페이커', '5,200,000,000']]
df = pd.DataFrame(mylists)
df

In [ ]:
df = pd.DataFrame(mylists, columns=['종목', '이름', '연봉'])
df

##딕셔너리(dict)로 만들기
- 추천 columns 을 지정되기 때문에 편하다.

In [ ]:
mydict = {'종목': ['야구', '축구', '롤'],
          '이름' :['류현진', '손흥민', '페이커'],
          '연봉' : ['22,300,000,000', '15,000,000,000', '5,200,000,000']}
df = pd.DataFrame(mydict)
df

## csv파일 읽고 쓰기

In [ ]:
# csv_path = '/content/drive/MyDrive/Part.2 파이썬 데이터 분석 및 머신러닝 기초 강의자료 및 부가자료/02. 파이썬을 활용한 데이터 전처리/kpop_boys.csv'

In [ ]:
# df = pd.read_csv(csv_path)

In [ ]:
# df.head() # 상위 5개의 columns만 출력

## 요약 정보 확인하기

In [ ]:
# df.info

## Pandas(데이터 슬라이싱) 활용하기

In [18]:
df = pd.read_csv('https://bit.ly/3gRXTfD')

In [19]:
# 상위 10개의 값 출력
df = df.iloc[:,1:11].head(10)
df

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight
0,Taeyeon,Kim Taeyeon,김태연,태연,1989-03-09,SNSD,South Korea,NaN,160,44
1,Sunny,Lee Sunkyu,이순규,써니,1989-05-15,SNSD,South Korea,NaN,158,43
2,Tiffany,Hwang Miyoung,황미영,티파니,1989-08-01,SNSD,South Korea,USA,163,50
3,Hyoyeon,Kim Hyoyeon,김효연,효연,1989-09-22,SNSD,South Korea,NaN,158,48
4,Yuri,Kwon Yuri,권유리,유리,1989-12-05,SNSD,South Korea,NaN,167,45
5,Sooyoung,Choi Sooyoung,최수영,수영,1990-02-10,SNSD,South Korea,NaN,170,48
6,Yoona,Im Yoona,임윤아,윤아,1990-05-30,SNSD,South Korea,NaN,166,47
7,Seohyun,Seo Joohyun,서주현,서현,1991-06-28,SNSD,South Korea,NaN,168,48
8,Jessica,Jessica Jung,제시카 정,제시카,1989-04-18,NaN,South Korea,NaN,0,0
9,CL,Lee Chaerin,이채린,씨엘,1991-02-26,2NE1,South Korea,NaN,0,0

## 행/열 선택하여 출력하기
>- 행 하나 가져오기 `(df['행 시작 인덱스'] : '행시작 인덱스+1'])`
>- 행 여개 가져오기 `(df['행 시작 인덱스') : ['행 끝 인덱스`])

In [ ]:
# 행 하나 가져오기
df[:1] # = df[0:1]

#### 행 여러개 가져오기

In [ ]:
# 행 여러ㅐ 가져오기
df[:2]

In [ ]:
df[5:]

In [ ]:
df[:5]

#### 열 가져오기
>- 열 하나 가져오기 `df['컬럼명']` or `df.컬럼명`
>- 열 여기개 가져오기 `df[['columns1', columns2', 'columns3']]]
>- 범위 설정으로 열 여러개 가져오기.
`df[df.columns[시작 인덱스:끝인덱스]])`

In [ ]:
#df의 모든 columns 출력
df.columns

In [ ]:
# 하나의 열  가져오기  비추천 너무 비효율적
df['Korean Name']

In [ ]:
# 특정 여러개의 열을 불러오기
df[['Korean Name', 'Group', 'Country']]

## **loc, iloc 을 사용해 편하개 조회하기**
>- loc, iloc은 pandas에서 데이터 조작을 쉽개 도와주는 명령어다.
>- 인덱싱(indexing)방식을 통해 데이터 읽기/쓰기, 슬라이싱 등 다양한 전처리 기능을 제공합니다.
>- 조건문을 기본적으로 활용할 수 있으며, 쿼리(SQL)문과 같이 원하는 조건에 맞는 데이터 추출 가능
>- 인덱스를 사용하여 바로 찾아내는 방식이기 때문에 매우 빠르다.

#### loc
>- 행과 열의 데이터 조회할 때는 `특정 레이블(label)`을 통해 접근 가능
>- `location`의 약어로, 사람이 읽을 수 있는 레이블 값을 사용

In [ ]:
df

**1. [loc] 특정 행 조회**

In [20]:
df.loc[0] # 행 첫 번째 출력

Stage Name            Taeyeon
Full Name         Kim Taeyeon
Korean Name               김태연
K. Stage Name              태연
Date of Birth      1989-03-09
Group                    SNSD
Country           South Korea
Second Country            NaN
Height                    160
Weight                     44
Name: 0, dtype: object

In [21]:
df.loc[:1] # 둘 이상 출력시 표로 나오는 것으로 추정

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight
0,Taeyeon,Kim Taeyeon,김태연,태연,1989-03-09,SNSD,South Korea,NaN,160,44
1,Sunny,Lee Sunkyu,이순규,써니,1989-05-15,SNSD,South Korea,NaN,158,43

In [ ]:
df.loc['Sunny']

In [ ]:
df.loc[[1,3,5]] # []구간이 아닌 특정 순서이면 []로 묶어주기

In [23]:
# 숫자에서 -> 문자열 인덱스로 변경
loc_df = df.copy() # 원본 훼손 방지를 위하여 카피
loc_df.index = loc_df['Korean Name'] # 인덱스 값을 'korean Name으로 변경
loc_df

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight
Korean Name,,,,,,,,,,
김태연,Taeyeon,Kim Taeyeon,김태연,태연,1989-03-09,SNSD,South Korea,NaN,160,44
이순규,Sunny,Lee Sunkyu,이순규,써니,1989-05-15,SNSD,South Korea,NaN,158,43
황미영,Tiffany,Hwang Miyoung,황미영,티파니,1989-08-01,SNSD,South Korea,USA,163,50
김효연,Hyoyeon,Kim Hyoyeon,김효연,효연,1989-09-22,SNSD,South Korea,NaN,158,48
권유리,Yuri,Kwon Yuri,권유리,유리,1989-12-05,SNSD,South Korea,NaN,167,45
최수영,Sooyoung,Choi Sooyoung,최수영,수영,1990-02-10,SNSD,South Korea,NaN,170,48
임윤아,Yoona,Im Yoona,임윤아,윤아,1990-05-30,SNSD,South Korea,NaN,166,47
서주현,Seohyun,Seo Joohyun,서주현,서현,1991-06-28,SNSD,South Korea,NaN,168,48
제시카 정,Jessica,Jessica Jung,제시카 정,제시카,1989-04-18,NaN,South Korea,NaN,0,0
이채린,CL,Lee Chaerin,이채린,씨엘,1991-02-26,2NE1,South Korea,NaN,0,0

In [24]:
loc_df.loc['임윤아'] #특정 문자 값 출력 가능

Stage Name              Yoona
Full Name            Im Yoona
Korean Name               임윤아
K. Stage Name              윤아
Date of Birth      1990-05-30
Group                    SNSD
Country           South Korea
Second Country            NaN
Height                    166
Weight                     47
Name: 임윤아, dtype: object

In [ ]:
loc_df.loc[['임윤아', '이순규', '김태연']]

**2.[loc] 조건문을 사용한 행 조회
(`df.loc[조건문]`)**

In [ ]:
df.head()

In [ ]:
df.loc[df['Korean Name'] == '임윤아']

In [ ]:
df.loc[df['Korean Name'] != '임윤아']

In [ ]:
df.loc[df['Height'] >= 160]

**3. [loc]특정 열 조회**

In [ ]:
df.columns

In [ ]:
# 특정 열 조회
df.loc[:, ['Korean Name']]

In [ ]:
df.loc[:, ['Korean Name', 'K. Stage Name']]

**4. [loc] 조거문을 사용하여 열 조회 (`df.loc[:, '조건문'])`**

In [ ]:
df.loc[:, df.columns == 'Korean Name']

In [ ]:
df.loc[:, df.columns != 'Korean Name']

**5.[loc] 행, 열 조건 조합**

In [ ]:
df.loc[df['Korean Name'] == '임윤아', ['Height']]

In [ ]:
df.loc[df['Korean Name'] == '임윤아', df.columns =='Height']

#### iloc
>- 행과 열의 데이터를 조회할 때 '숫자 인덱스(integer index)을 통해 접근
>- `integer location의 약어로, 컴퓨터가 읽을 수 있는 인덱스 값을 사용

In [ ]:
iloc_df = loc_df.copy()
iloc_df

**1. [iloc]특정 `행` 조회**

In [ ]:
# 특정 행 조회
iloc_df.iloc[0]

In [ ]:
iloc_df.iloc[[0,3,5]]

In [ ]:
iloc_df.iloc[1:5]

**2. [iloc] 특정 열 조회**

In [ ]:
# 특정 열 조회
iloc_df.iloc[:, 1:4] # 1 = index 시작 / 3= 끝나는 값 -1

## Boolean Indexing, isin()
>- 참/거짓 여부를 판단해서 특정 조건이 맞는 데이터만 추출하는 방법

**1. Boolean Indexing**

In [ ]:
df

In [ ]:
df['Height'] > 160

In [ ]:
df.loc[df['Height'] >160]

**2. isin()을 활용한 색인**
>- 내가 정한 리스트(list)안에 있는 값들만 가져오고 싶을 때 사용된다.

In [ ]:
df

In [ ]:
group_name = ['SNSD'] # 리스트를 저장
df['Group'].isin(group_name)

In [ ]:
df.loc[df['Group'].isin(group_name)]

## 행(row), 열(column) 추가 및 삭제
>- 행 추가 : `df.append('추가할 행 정도(dict 또는 Series/DataFrame 타입)`
    - 인덱스를 무시하는 옵션 **ignore_index=True**을 반드시 추가해야 한다. 
>- 열 추가 : **df['추가할 열 이름'] ='추가할 일 정보(list or Series type)**
>-행/ 열 삭제:
    -행 삭제 :**df.drop(index=['delete row index'])**
    -열 삭제 : **df.drop(columns=('delete column name'])**

In [ ]:
df

> 딕셔너리(dict)를 활용한 행 추가

In [ ]:
new_row = {'Stage Name' : 'FastCampus',
           'Full name' : 'FastCampus',
           'Korean Name' : '패스트캠퍼스',
           'K. Stage Name' : '패캠',
           'Date of Birth' : '2017-01-01',
           'Group' : 'Fc',
           'Country' : 'South Korea',
           'Second Country' : None,
           'Height' : 180,
           'Weight' : 80}
# None, 숫자는 ''로 감싸주지 않는다. (Null value, int 값)

In [ ]:
df = df.append(new_row, ignore_index=True)
df

> Series를 활용한 행 추가

In [ ]:
type(df.iloc[-1])

In [ ]:
df.append(df.iloc[-1])

> column append(열 추가
>- `df['append column name'] = ['column value list']`
>- append type list , len = all row count.
>- df['추가할 열 이름'] = ['열에 대입할 값 리스트']
>- 리스트 형으로 열을 추가할 경우, 길이가 전체 행 수와 같아야 한다.

In [ ]:
df

In [ ]:
df['Blood Type'] = 'A'

In [ ]:
df

In [ ]:
len(df)

In [ ]:
df['Blood Type'] = ['A']*5 + ['B'] * 5
df

> row/ column remove
>- remove row : `df.drop(index=['delete row index'])
>- remove column : `df.drop(columns=['remove column name'])

In [ ]:
df = df.drop(index=['10,11,12'])
# 값들이 없어서 error

In [ ]:
df = df.drop(columns=['Blood Type'])
df

## 통계값 계산 및 정렬 방법 익히기

In [ ]:
df = pd.read_csv('http://bit.ly/3gRXTfD')

In [ ]:
df = df.iloc[:,1:11].head(8)
df

### 요약 정보 확인
>- `info()` = Null값과 컬럼수, 데이터 타입 확인할 때 사용된다.

In [ ]:
df.info()

- `shape` 을 사용하여 데이터 프레임 형태 확인
>- `shape`은 튜플(tuple)형태로 데이터 프레임의 형태를 알려준다. 첫번째는 row, 두번째는 column 정보이다

In [ ]:
df.shape
# row = 8//// column = 10

- `head()`, `tail()`을 사용한 부분 정보 출력

In [ ]:
# .head() --- 상위 10개 출력
# .head(n) --- 상위 n개 출력
# .tail() --- 하위 10개 출력
# .tail(n) --- 하위 n개 출력
df.head(4)

In [ ]:
df.tail(3)

>`describe()` 를 사용한 통계 정보 확인
>- `describe()`는 주로 데이터 분석을 시작하기 전, 숫자형(int) 데이터가 어떻게 생겼는지 빠르게 요약 통계 정보를 확인
>- 갯수(count), 평균(mean), 표준편차(std), 최소값(min), 1사분위수(25%), 2사분위수(50%), 3사분위수(75%), 최대값(max)

In [ ]:
df.describe() # 숫자로 이루어진 columns의 평균값

### 데이터 프레임 정렬하기

> 인덱스(index) 기준 정렬
>- `sort_index()`는 데이터 프레임의 인덱스를 기준으로 정렬해준다.

In [ ]:
# 오름차순 정렬 index (default 정렬) index기준
df.sort_index()

In [ ]:
# 내림차순 정렬 (ascending=False 추가) index기준
df.sort_index(ascending=False)

> 값(value) 기준 정렬
>- `sort_values()`는 데이터 프레임의 값을 기준으로 정렬

In [ ]:
df.sort_values(by='Height')

In [ ]:
# 내림차순
df.sort_values(by='Height', ascending=False)

> 복수 값(Multi-values)기준 정렬
>- `sort_values(by=['column', ''column2',...]`는 복수 값을 기준으로도 데이터 프레임을 정렬할 수 있다.
>- 첫번째 값을 기준으로 우선 정렬을 하고, 그다음 두번째 컬럼 기준으로 정렬

In [ ]:
#복수 값 기준 정렬
df.sort_values(by=['Height', 'Weight'])

In [ ]:
#복수 값 내림차순
df.sort_values(by=['Height', 'Weight'], ascending=False)

- df.sort_values(by=['Height', 'Weight'], ascending=[True, False])
-`Height column`은 오름차순으로 정렬
`Weight column`은 내림차순으로 정렬
However `Height`먼저 정렬후 Weight정렬

In [ ]:
df.sort_values(by=['Height', 'Weight'], ascending=[True, False])

## 피벗 테이블(pivot table) 기능과 그룹 통계(groupby)

In [ ]:
df= pd.read_csv('https://bit.ly/3gRXTfD')

In [ ]:
df = df.iloc[:, 1:11].head(200)
df = df.loc[(df['Height']!=0)&(df['Weight']!=0)].dropna(subset=['Group'], axis=0).reset_index(drop=True)

In [ ]:
df.info()

### 피벗 테이블 (pivot_table)

>피벗 테이블(pivot table)
>- 피벗 테이블 = 방대한 표(데이터베이스, 스트레드 시트,...) 데이터를 요약하는 통계표입니다.
>-이 요약에는 합계, 평균, 기타 통계가 포함/ 우리가 원하는 방식으로 묶거나 정렬 가능
>- 엑셀에서 사용되는 피벗 테이블과 동일 개념
>- 기본 사용법
    - **`pd.pivot_table(df, index = 'row index', columns = 'columns index', values = '조회하고 싶은 값', aggfunc='집계 방식')`**

In [ ]:
df.head()

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight
0,Taeyeon,Kim Taeyeon,김태연,태연,1989-03-09,SNSD,South Korea,NaN,160,44
1,Sunny,Lee Sunkyu,이순규,써니,1989-05-15,SNSD,South Korea,NaN,158,43
2,Tiffany,Hwang Miyoung,황미영,티파니,1989-08-01,SNSD,South Korea,USA,163,50
3,Hyoyeon,Kim Hyoyeon,김효연,효연,1989-09-22,SNSD,South Korea,NaN,158,48
4,Yuri,Kwon Yuri,권유리,유리,1989-12-05,SNSD,South Korea,NaN,167,45

In [ ]:
# pd.pivot_table(csv_name, row_name, column_name, values, aggfunc(집계방식))
pd.pivot_table(df, index='Group', columns='Country', values='Height', aggfunc='mean')

Country     China  South Korea  Thailand
Group
9Muses        NaN   170.000000       NaN
AoA           NaN   166.500000       NaN
BLACKPINK     NaN   162.500000     170.0
CLC           NaN   167.000000       NaN
Girl's Day    NaN   166.750000       NaN
Gugudan       NaN   165.000000       NaN
LABOUM        NaN   165.250000       NaN
Lovelyz       NaN   164.000000       NaN
Mamamoo       NaN   163.000000       NaN
Oh My Girl    NaN   161.714286       NaN
SNSD          NaN   163.750000       NaN
T-ara         NaN   165.750000       NaN
f(x)        168.0          NaN       NaN

In [ ]:
pd.pivot_table(df, index='Group', columns='Country', values='Height', aggfunc=sum)

Country     China  South Korea  Thailand
Group
9Muses        NaN        850.0       NaN
AoA           NaN        666.0       NaN
BLACKPINK     NaN        325.0     170.0
CLC           NaN        167.0       NaN
Girl's Day    NaN        667.0       NaN
Gugudan       NaN        495.0       NaN
LABOUM        NaN        661.0       NaN
Lovelyz       NaN       1148.0       NaN
Mamamoo       NaN        652.0       NaN
Oh My Girl    NaN       1132.0       NaN
SNSD          NaN       1310.0       NaN
T-ara         NaN        663.0       NaN
f(x)        168.0          NaN       NaN

In [ ]:
pd.pivot_table(df, index='Group', columns='Country', values='Height', aggfunc='count')

Country     China  South Korea  Thailand
Group
9Muses        NaN          5.0       NaN
AoA           NaN          4.0       NaN
BLACKPINK     NaN          2.0       1.0
CLC           NaN          1.0       NaN
Girl's Day    NaN          4.0       NaN
Gugudan       NaN          3.0       NaN
LABOUM        NaN          4.0       NaN
Lovelyz       NaN          7.0       NaN
Mamamoo       NaN          4.0       NaN
Oh My Girl    NaN          7.0       NaN
SNSD          NaN          8.0       NaN
T-ara         NaN          4.0       NaN
f(x)          1.0          NaN       NaN

### 그룹 통꼐(groupby)

> 그룹으로 묶기(gorupby)
>- 그룹으로 묶기(groupby)는 피벗 테이블과 유사한 개념으로, 같은 값을 그룹으로 묶어서 분석할 떄 사용된다.
>- 그룹으로 묶는 기준(ex, sex, age, blood-type)에 따라서 합계, 평균, 분산, 최대/최소 값 등으로 통계를 구할 수 있다
>- 기본 사용법
    - `df.groupby('그룹 구분').count()` = 갯수
    - `df.groupby('그룹 구분').sum()` = 합계
    - `df.groupby('그룹 구분').mean()` = 평균
    - `df.groupby('그룹 구분').var()` = 분산
    - `df.groupby('그룹 구분').std()` = 표준 편차
    - `df.groupby('그룹 구분').min()/.max()` = 최대/최소값

In [ ]:
df.head()

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight
0,Taeyeon,Kim Taeyeon,김태연,태연,1989-03-09,SNSD,South Korea,NaN,160,44
1,Sunny,Lee Sunkyu,이순규,써니,1989-05-15,SNSD,South Korea,NaN,158,43
2,Tiffany,Hwang Miyoung,황미영,티파니,1989-08-01,SNSD,South Korea,USA,163,50
3,Hyoyeon,Kim Hyoyeon,김효연,효연,1989-09-22,SNSD,South Korea,NaN,158,48
4,Yuri,Kwon Yuri,권유리,유리,1989-12-05,SNSD,South Korea,NaN,167,45

In [ ]:
df.groupby('Group').mean()

                Height     Weight
Group
9Muses      170.000000  47.800000
AoA         166.500000  46.750000
BLACKPINK   165.000000  47.000000
CLC         167.000000  48.000000
Girl's Day  166.750000  47.250000
Gugudan     165.000000  48.666667
LABOUM      165.250000  47.250000
Lovelyz     164.000000  45.571429
Mamamoo     163.000000  43.750000
Oh My Girl  161.714286  48.428571
SNSD        163.750000  46.625000
T-ara       165.750000  44.750000
f(x)        168.000000  45.000000

In [ ]:
df.groupby('Group')['Height'].mean()

Group
9Muses        170.000000
AoA           166.500000
BLACKPINK     165.000000
CLC           167.000000
Girl's Day    166.750000
Gugudan       165.000000
LABOUM        165.250000
Lovelyz       164.000000
Mamamoo       163.000000
Oh My Girl    161.714286
SNSD          163.750000
T-ara         165.750000
f(x)          168.000000
Name: Height, dtype: float64

- 여러 개 그룹 지정

In [ ]:
df.groupby(['Group', 'Country']).mean()

                            Height     Weight
Group      Country
9Muses     South Korea  170.000000  47.800000
AoA        South Korea  166.500000  46.750000
BLACKPINK  South Korea  162.500000  47.500000
           Thailand     170.000000  46.000000
CLC        South Korea  167.000000  48.000000
Girl's Day South Korea  166.750000  47.250000
Gugudan    South Korea  165.000000  48.666667
LABOUM     South Korea  165.250000  47.250000
Lovelyz    South Korea  164.000000  45.571429
Mamamoo    South Korea  163.000000  43.750000
Oh My Girl South Korea  161.714286  48.428571
SNSD       South Korea  163.750000  46.625000
T-ara      South Korea  165.750000  44.750000
f(x)       China        168.000000  45.000000

In [ ]:
df.groupby(['Group', 'Country']).mean().reset_index()
# .reset_index() = 인덱스를 분리

In [ ]:
df.groupby('Height').get_group(165)
# 숫자값도 가능하다.

- 그룹 데이터 확인(`get_group()`)

In [ ]:
df.groupby('Group')

In [ ]:
df.groupby('Group').groups
# 각 그룹들의 인덱스 번호 출력

{'9Muses': [16, 17, 18, 19, 20], 'AoA': [8, 9, 10, 11], 'BLACKPINK': [52, 53, 54], 'CLC': [51], 'Girl's Day': [12, 13, 14, 15], 'Gugudan': [22, 23, 24], 'LABOUM': [39, 40, 41, 42], 'Lovelyz': [32, 33, 34, 35, 36, 37, 38], 'Mamamoo': [47, 48, 49, 50], 'Oh My Girl': [25, 26, 27, 28, 29, 30, 31], 'SNSD': [0, 1, 2, 3, 4, 5, 6, 7], 'T-ara': [43, 44, 45, 46], 'f(x)': [21]}

In [ ]:
df.groupby('Group').get_group('BLACKPINK')

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight
52,Jisoo,Kim Jisoo,김지수,지수,1995-01-03,BLACKPINK,South Korea,NaN,162,45
53,Jennie,Kim Jennie,김제니,제니,1996-01-16,BLACKPINK,South Korea,NaN,163,50
54,Lisa,Pranpriya Manoban,쁘란쁘리야 마노반,리사,1997-03-27,BLACKPINK,Thailand,NaN,170,46

In [ ]:
df.groupby('Group').mean()

                Height     Weight
Group
9Muses      170.000000  47.800000
AoA         166.500000  46.750000
BLACKPINK   165.000000  47.000000
CLC         167.000000  48.000000
Girl's Day  166.750000  47.250000
Gugudan     165.000000  48.666667
LABOUM      165.250000  47.250000
Lovelyz     164.000000  45.571429
Mamamoo     163.000000  43.750000
Oh My Girl  161.714286  48.428571
SNSD        163.750000  46.625000
T-ara       165.750000  44.750000
f(x)        168.000000  45.000000

In [ ]:
df.groupby('Group').agg({'Height' : 'mean', 'Weight' : 'sum'})
# Height = 평균/// Weight = 합계. 
# 각각의 데이터 값을 표현 할 수 있다.

                Height  Weight
Group
9Muses      170.000000     239
AoA         166.500000     187
BLACKPINK   165.000000     141
CLC         167.000000      48
Girl's Day  166.750000     189
Gugudan     165.000000     146
LABOUM      165.250000     189
Lovelyz     164.000000     319
Mamamoo     163.000000     175
Oh My Girl  161.714286     339
SNSD        163.750000     373
T-ara       165.750000     179
f(x)        168.000000      45

## 데이터 합치기(Join & Merge)

In [ ]:
# 실습 파일 로딩 (아이돌 프로필)
df = pd.read_csv('https://bit.ly/3gRXTfD')

In [ ]:
df1 = df.iloc[:, 1:11].head(5)
df2 = df.loc[3:10, ['Korean Name', 'Instagram']]

### Join

- 두개의 데이터 프레임(Data Frame) 을 겹치는 '인덱스' 기준으로 합치는 것
>- Join에는 `Inner Join`, `Left Join`, `Right Join`, `Outer Join`, 4가지 방식이 있다.
    - Inner Join = 교집합 데이터만 살리기 
    - Left Join = 첫번째 데이터 프레임과 교집합만 살리기
    - Right Join = 두번째 데이터 프레임과 교집합만 살리기
    - outer Join = 모든 값을 다 살리기
>- 기본 사용법
    - `df1.join(df2, on='key index', how='조인방법, sort='정렬 여부')`

**인덱스 일체화를 시켜주어야 한다(비추천)**

In [ ]:
#df1.join(df2, on='Korean Name', how='left')  #sync error = index 일치화
df1.join(df2.set_index('Korean Name'), on='Korean Name', how='left')

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight,Instagram
0,Taeyeon,Kim Taeyeon,김태연,태연,1989-03-09,SNSD,South Korea,NaN,160,44,NaN
1,Sunny,Lee Sunkyu,이순규,써니,1989-05-15,SNSD,South Korea,NaN,158,43,NaN
2,Tiffany,Hwang Miyoung,황미영,티파니,1989-08-01,SNSD,South Korea,USA,163,50,NaN
3,Hyoyeon,Kim Hyoyeon,김효연,효연,1989-09-22,SNSD,South Korea,NaN,158,48,watasiwahyo
4,Yuri,Kwon Yuri,권유리,유리,1989-12-05,SNSD,South Korea,NaN,167,45,yulyulk

In [ ]:
df1.join(df2.set_index('Korean Name'), on='Korean Name', how='right')
# df1 = right /// df2 = left

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight,Instagram
3.0,Hyoyeon,Kim Hyoyeon,김효연,효연,1989-09-22,SNSD,South Korea,NaN,158.0,48.0,watasiwahyo
4.0,Yuri,Kwon Yuri,권유리,유리,1989-12-05,SNSD,South Korea,NaN,167.0,45.0,yulyulk
NaN,NaN,NaN,최수영,NaN,NaN,NaN,NaN,NaN,NaN,NaN,hotsootuff
NaN,NaN,NaN,임윤아,NaN,NaN,NaN,NaN,NaN,NaN,NaN,yoona__lim
NaN,NaN,NaN,서주현,NaN,NaN,NaN,NaN,NaN,NaN,NaN,seojuhyun_s
NaN,NaN,NaN,제시카 정,NaN,NaN,NaN,NaN,NaN,NaN,NaN,jessica.syj
NaN,NaN,NaN,이채린,NaN,NaN,NaN,NaN,NaN,NaN,NaN,chaelincl
NaN,NaN,NaN,박봄,NaN,NaN,NaN,NaN,NaN,NaN,NaN,haroobommi

In [ ]:
df1.join(df2.set_index('Korean Name'), on='Korean Name', how='inner') 
# inner 교집합

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight,Instagram
3,Hyoyeon,Kim Hyoyeon,김효연,효연,1989-09-22,SNSD,South Korea,NaN,158,48,watasiwahyo
4,Yuri,Kwon Yuri,권유리,유리,1989-12-05,SNSD,South Korea,NaN,167,45,yulyulk

In [ ]:
df1.join(df2.set_index('Korean Name'), on='Korean Name', how='outer')
# outer 여집합

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight,Instagram
0.0,Taeyeon,Kim Taeyeon,김태연,태연,1989-03-09,SNSD,South Korea,NaN,160.0,44.0,NaN
1.0,Sunny,Lee Sunkyu,이순규,써니,1989-05-15,SNSD,South Korea,NaN,158.0,43.0,NaN
2.0,Tiffany,Hwang Miyoung,황미영,티파니,1989-08-01,SNSD,South Korea,USA,163.0,50.0,NaN
3.0,Hyoyeon,Kim Hyoyeon,김효연,효연,1989-09-22,SNSD,South Korea,NaN,158.0,48.0,watasiwahyo
4.0,Yuri,Kwon Yuri,권유리,유리,1989-12-05,SNSD,South Korea,NaN,167.0,45.0,yulyulk
NaN,NaN,NaN,최수영,NaN,NaN,NaN,NaN,NaN,NaN,NaN,hotsootuff
NaN,NaN,NaN,임윤아,NaN,NaN,NaN,NaN,NaN,NaN,NaN,yoona__lim
NaN,NaN,NaN,서주현,NaN,NaN,NaN,NaN,NaN,NaN,NaN,seojuhyun_s
NaN,NaN,NaN,제시카 정,NaN,NaN,NaN,NaN,NaN,NaN,NaN,jessica.syj
NaN,NaN,NaN,이채린,NaN,NaN,NaN,NaN,NaN,NaN,NaN,chaelincl
NaN,NaN,NaN,박봄,NaN,NaN,NaN,NaN,NaN,NaN,NaN,haroobommi

### Merge(추천)

두개의 데이터 프레임(Data Frame)을 겹치는 값(value)기준으로 합치는 것.
- Merge를 사용하면, Join에서 겹치는 인덱스를 따로 지정해 주어야 하는 작업이 필요 없다. 
- 단지 **두개 이상의 겹치는 컬럼만 있으면 됩니다.**
- Join과 똑같이 `Inner Merge`, `Left Merge`, `Right Merge`, `Outer Merge`, 4가지 방식이 있다.
- 기본 사용법
    - `pd.merge(df1, on='key column', how='조인 방법', sort'정렬 여부')`

In [ ]:
# Left Merge
pd.merge(df1, df2, on='Korean Name', how='left')
pd.merge(df1, df2, on='Korean Name', how='right')
pd.merge(df1, df2, on='Korean Name', how='inner')
pd.merge(df1, df2, on='Korean Name', how='outer')

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight,Instagram
0,Taeyeon,Kim Taeyeon,김태연,태연,1989-03-09,SNSD,South Korea,NaN,160,44,NaN
1,Sunny,Lee Sunkyu,이순규,써니,1989-05-15,SNSD,South Korea,NaN,158,43,NaN
2,Tiffany,Hwang Miyoung,황미영,티파니,1989-08-01,SNSD,South Korea,USA,163,50,NaN
3,Hyoyeon,Kim Hyoyeon,김효연,효연,1989-09-22,SNSD,South Korea,NaN,158,48,watasiwahyo
4,Yuri,Kwon Yuri,권유리,유리,1989-12-05,SNSD,South Korea,NaN,167,45,yulyulk

### Concat

- 두개의 데이터 프레임(Data Frame)을 단순히 붙이는 방법
    >- 위의 Join, Merge개념과 다른 개념
    >- `concat`은 행이나 열방향으로 데이터 프레임을 붙일 수 있다.
    >- 행 붙이기 (axis=0), 열방향 붙이기 (axis=1)
    >- 기본 사용법
    >- `pd.concat([df1, df2], axis='행붙이는 방향')

In [ ]:
pd.concat([df1, df2], axis=0)

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight,Instagram
0,Taeyeon,Kim Taeyeon,김태연,태연,1989-03-09,SNSD,South Korea,NaN,160.0,44.0,NaN
1,Sunny,Lee Sunkyu,이순규,써니,1989-05-15,SNSD,South Korea,NaN,158.0,43.0,NaN
2,Tiffany,Hwang Miyoung,황미영,티파니,1989-08-01,SNSD,South Korea,USA,163.0,50.0,NaN
3,Hyoyeon,Kim Hyoyeon,김효연,효연,1989-09-22,SNSD,South Korea,NaN,158.0,48.0,NaN
4,Yuri,Kwon Yuri,권유리,유리,1989-12-05,SNSD,South Korea,NaN,167.0,45.0,NaN
3,NaN,NaN,김효연,NaN,NaN,NaN,NaN,NaN,NaN,NaN,watasiwahyo
4,NaN,NaN,권유리,NaN,NaN,NaN,NaN,NaN,NaN,NaN,yulyulk
5,NaN,NaN,최수영,NaN,NaN,NaN,NaN,NaN,NaN,NaN,hotsootuff
6,NaN,NaN,임윤아,NaN,NaN,NaN,NaN,NaN,NaN,NaN,yoona__lim
7,NaN,NaN,서주현,NaN,NaN,NaN,NaN,NaN,NaN,NaN,seojuhyun_s
8,NaN,NaN,제시카 정,NaN,NaN,NaN,NaN,NaN,NaN,NaN,jessica.syj
9,NaN,NaN,이채린,NaN,NaN,NaN,NaN,NaN,NaN,NaN,chaelincl
10,NaN,NaN,박봄,NaN,NaN,NaN,NaN,NaN,NaN,NaN,haroobommi

In [ ]:
pd.concat([df1, df2], axis=1)

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight,Korean Name,Instagram
0,Taeyeon,Kim Taeyeon,김태연,태연,1989-03-09,SNSD,South Korea,NaN,160.0,44.0,NaN,NaN
1,Sunny,Lee Sunkyu,이순규,써니,1989-05-15,SNSD,South Korea,NaN,158.0,43.0,NaN,NaN
2,Tiffany,Hwang Miyoung,황미영,티파니,1989-08-01,SNSD,South Korea,USA,163.0,50.0,NaN,NaN
3,Hyoyeon,Kim Hyoyeon,김효연,효연,1989-09-22,SNSD,South Korea,NaN,158.0,48.0,김효연,watasiwahyo
4,Yuri,Kwon Yuri,권유리,유리,1989-12-05,SNSD,South Korea,NaN,167.0,45.0,권유리,yulyulk
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,최수영,hotsootuff
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,임윤아,yoona__lim
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,서주현,seojuhyun_s
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,제시카 정,jessica.syj
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,이채린,chaelincl
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,박봄,haroobommi

In [ ]:
# 겹치는 값만 활용하기)(Join!!!)
pd.concat([df1, df2], axis=1, join='inner')

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight,Korean Name,Instagram
3,Hyoyeon,Kim Hyoyeon,김효연,효연,1989-09-22,SNSD,South Korea,NaN,158,48,김효연,watasiwahyo
4,Yuri,Kwon Yuri,권유리,유리,1989-12-05,SNSD,South Korea,NaN,167,45,권유리,yulyulk

## Pandas 자료형 변환, 산술 연산

In [ ]:
df = pd.read_csv('https://bit.ly/3gRXTfD')

In [ ]:
df = df.iloc[:, 1:11].head(7)

In [ ]:
df = df[['Korean Name', 'Date of Birth', 'Height', 'Weight']]
df

  Korean Name Date of Birth  Height  Weight
0         김태연    1989-03-09     160      44
1         이순규    1989-05-15     158      43
2         황미영    1989-08-01     163      50
3         김효연    1989-09-22     158      48
4         권유리    1989-12-05     167      45
5         최수영    1990-02-10     170      48
6         임윤아    1990-05-30     166      47

### 자료형 변환

- Pandas에서는 `astype('변화하려는 자료형')` 으로 데이터 자료를 변환할 수 있다.
> - 자주 쓰이는 Pandas 자료형은 정수(int), 실수(float), 문자열(str), 일지 시간 타입(datetime)이 있습니다. 
> -일자 시간 타입은 `to_datetime()` 함수로 손쉽게 변환이 가능합니다.

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Korean Name    7 non-null      object
 1   Date of Birth  7 non-null      object
 2   Height         7 non-null      object
 3   Weight         7 non-null      int64
dtypes: int64(1), object(3)
memory usage: 352.0+ bytes

In [ ]:
df['Height'] = df['Height'].astype('str')

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

**str -> int 타입 변경**

In [ ]:
df['Height'] = df['Height'].astype(int)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Korean Name    7 non-null      object
 1   Date of Birth  7 non-null      object
 2   Height         7 non-null      int64
 3   Weight         7 non-null      int64
dtypes: int64(2), object(2)
memory usage: 352.0+ bytes

In [ ]:
type(df['Height'][0])

numpy.int64

**str -> datetime 타입 변환(`pd.to_datetime(df['column'])**
- datetime 이란?
    >- Pandas 에서 날짜와 시간 데이터를 처리하기 위해 지원하는 자료형이다.
    >- datetime 자료형으로 변환하면, 날짜 슬라이싱, 시간 연산(일,시,분,초,초단위)가능하다.
    >- Python자체적으로 제공하는 `datetime`라이브러리이다.

In [ ]:
df['Date of Birth'][0]

'1989-03-09'

In [ ]:
df['Date of Birth'] = pd.to_datetime(df['Date of Birth'])

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df['Date of Birth'][0]

Timestamp('1989-03-09 00:00:00')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Korean Name    7 non-null      object
 1   Date of Birth  7 non-null      datetime64[ns]
 2   Height         7 non-null      int64
 3   Weight         7 non-null      int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 352.0+ bytes

> **datetime 타입 으로 날짜 슬라이싱**
> - datetime으로 변환된 데이터는, 손쉽게 월, 일, 요일 등 날짜/시간 정보를 추출할 수 있습니다.
> - datetime의 약어 인 `dt`를 사용한다.

In [ ]:
df['Date of Birth']

0   1989-03-09
1   1989-05-15
2   1989-08-01
3   1989-09-22
4   1989-12-05
5   1990-02-10
6   1990-05-30
Name: Date of Birth, dtype: datetime64[ns]

In [ ]:
df['Date of Birth'].dt

In [ ]:
df['Date of Birth'].dt.year # 연도 만 추출
df['Date of Birth'].dt.month # 월만 추출
df['Date of Birth'].dt.day # 날짜만 추출

0    1989
1    1989
2    1989
3    1989
4    1989
5    1990
6    1990
Name: Date of Birth, dtype: int64

In [ ]:
#요일 추출 가능 월=0, 화=1, 수=2 ... 일=6
df['Date of Birth'].dt.dayofweek

0    3
1    0
2    1
3    4
4    1
5    5
6    2
Name: Date of Birth, dtype: int64

In [ ]:
#데이터 프레임에 추가하기
df['Year of Birth'] = df['Date of Birth'].dt.year
df['Month of Birth'] = df['Date of Birth'].dt.month
df['Day of Birth'] = df['Date of Birth'].dt.day

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [ ]:
df

,Korean Name,Date of Birth,Height,Weight,Year of Birth,Month of Birth,Day of Birth
0,김태연,1989-03-09,160,44,1989,3,9
1,이순규,1989-05-15,158,43,1989,5,15
2,황미영,1989-08-01,163,50,1989,8,1
3,김효연,1989-09-22,158,48,1989,9,22
4,권유리,1989-12-05,167,45,1989,12,5
5,최수영,1990-02-10,170,48,1990,2,10
6,임윤아,1990-05-30,166,47,1990,5,30

### 산술 연신

> - pandas에서는 `같은 타입` 자료형을 가지는 데이터끼리 산술 연산이 가능하다.
> - 다른 타입 자료형 연산을 시도할 경우, 에러가 발생하니 그전에 자료형 확인을 해주세요!!

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Korean Name     7 non-null      object
 1   Date of Birth   7 non-null      datetime64[ns]
 2   Height          7 non-null      int64
 3   Weight          7 non-null      int64
 4   Year of Birth   7 non-null      int64
 5   Month of Birth  7 non-null      int64
 6   Day of Birth    7 non-null      int64
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 520.0+ bytes

In [ ]:
df['Height'] + df['Weight']
df['Height'] - df['Weight']
df['Height'] * df['Weight']
df['Height'] / df['Weight']

0    204
1    201
2    213
3    206
4    212
5    218
6    213
dtype: int64

> **데이트타임(datetime) 연산**
> - Pandas에서 날짜/시간 연산을 하기 위해서는, 더하고 빼는 값의 자료형이 시간 간격(pd.Timedelta)이어야 한다.
> - `pd.to_timedelta(df['column'], unit='시간 간격 단위')
> - 변환할 수 있는 시간 간격 단위는 일(day), 시(hour), 분(min), 초(sec)있다.

In [ ]:
df['Date of Birth'] + df['Date of Birth']
#sync error day + day 는 불가능하다.

TypeError: ignored

In [ ]:
df['Day of Birth'] = pd.to_timedelta(df['Day of Birth'], unit='day')

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df

,Korean Name,Date of Birth,Height,Weight,Year of Birth,Month of Birth,Day of Birth
0,김태연,1989-03-09,160,44,1989,3,9 days
1,이순규,1989-05-15,158,43,1989,5,15 days
2,황미영,1989-08-01,163,50,1989,8,1 days
3,김효연,1989-09-22,158,48,1989,9,22 days
4,권유리,1989-12-05,167,45,1989,12,5 days
5,최수영,1990-02-10,170,48,1990,2,10 days
6,임윤아,1990-05-30,166,47,1990,5,30 days

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Korean Name     7 non-null      object
 1   Date of Birth   7 non-null      datetime64[ns]
 2   Height          7 non-null      int64
 3   Weight          7 non-null      int64
 4   Year of Birth   7 non-null      int64
 5   Month of Birth  7 non-null      int64
 6   Day of Birth    7 non-null      timedelta64[ns]
dtypes: datetime64[ns](1), int64(4), object(1), timedelta64[ns](1)
memory usage: 520.0+ bytes

In [ ]:
df['Day of Birth'] + df['Day of Birth']

0   18 days
1   30 days
2    2 days
3   44 days
4   10 days
5   20 days
6   60 days
Name: Day of Birth, dtype: timedelta64[ns]

> **통계 연산**
> - 합계`(sum())`, 평균`(mean())`, 최소/최대값`(min(), max())`, 과 같은 통계 연산도 가능하다.
> - 행 계산`(axis = 0)`, 열 계산`(axis = 1)`
> - index기준으로 행과 열 계산!!!

In [ ]:
df = pd.DataFrame({'국어': [100, 60, 50, 75], '수학': [80, 70, 65, 90], '영어': [90, 55, 85, 70]})

In [ ]:
df

    국어  수학  영어
0  100  80  90
1   60  70  55
2   50  65  85
3   75  90  70

In [ ]:
df.sum()

국어    285
수학    305
영어    300
dtype: int64

In [ ]:
df.sum(axis=1)

0    270
1    185
2    200
3    235
dtype: int64

## 결축값, 중복 처리

In [2]:
df = pd.read_csv('https://bit.ly/3gRXTfD')

In [3]:
df = df.iloc[15:30]
df

,Profile,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight,Birthplace,Other Group,Former Group,Gender,Position,Instagram,Twitter
15,NaN,Soyou,Kang Jihyun,강지현,소유,1992-02-12,SISTAR,South Korea,NaN,0,0,NaN,NaN,NaN,F,NaN,soooo_you,NaN
16,NaN,Dasom,Kim Dasom,김다솜,다솜,1993-05-06,SISTAR,South Korea,NaN,0,0,NaN,NaN,NaN,F,NaN,som0506,NaN
17,NaN,Jihyun,Nam Jihyun,남지현,지현,1990-01-09,4minute,South Korea,NaN,167,0,Seoul,NaN,NaN,F,NaN,njh9019,NaN
18,NaN,Gayoon,Heo Gayoon,허가윤,가윤,1990-05-18,4minute,South Korea,NaN,165,0,Seoul,2YOON,NaN,F,NaN,gayoon_heo,NaN
19,NaN,Jiyoon,Jeon Jiyoon,전지윤,지윤,1990-10-15,4minute,South Korea,NaN,165,0,Seoul,2YOON,NaN,F,NaN,jenyerjiyoon,NaN
20,NaN,Hyuna,Kim Hyuna,김현아,현아,1992-06-06,4minute,South Korea,NaN,164,0,Jeolla,NaN,Wonder Girls,F,NaN,hyunah_aa,NaN
21,NaN,Sohyun,Kwon Sohyun,권소현,소현,1994-08-30,4minute,South Korea,NaN,162,0,Seoul,NaN,NaN,F,NaN,kkwonsso_94,NaN
22,Profile,Jimin,Shin Jimin,신지민,지민,1991-01-08,NaN,South Korea,NaN,160,43,Seoul,AOA BLACK,AoA,F,NaN,jiminbaby_18,NaN
23,Profile,Choa,Park Choa,박초아,초아,1990-03-06,NaN,South Korea,NaN,160,42,Incheon,NaN,"AoA, AOA BLACK",F,NaN,queenchoa_,NaN
24,Profile,Yuna,Seo Yuna,서유나,유나,1992-12-30,AoA,South Korea,NaN,163,45,Busan,AOA BLACK,NaN,F,NaN,yn_s_1230,NaN
25,NaN,Yookyung,Seo Yookyung,서유경,유경,1993-03-15,NaN,South Korea,NaN,167,48,NaN,NaN,AOA BLACK,F,NaN,NaN,NaN
26,Profile,Hyejeong,Shin Hyejeong,신혜정,혜정,1993-08-10,AoA,South Korea,NaN,170,48,Seoul,NaN,NaN,F,NaN,dongdong810,NaN
27,Profile,Mina,Kwon Mina,권민아,민아,1993-09-21,NaN,South Korea,NaN,159,43,Busan,NaN,"AOA, AOA BLACK",F,NaN,kvwowv,NaN
28,Profile,Seolhyun,Kim Seolhyun,김설현,설현,1995-01-03,AoA,South Korea,NaN,167,47,Bucheon,NaN,NaN,F,NaN,sh_9513,NaN
29,Profile,Chanmi,Kim Chanmi,김찬미,찬미,1996-06-19,AoA,South Korea,NaN,166,47,Gumi,NaN,NaN,F,NaN,chanmi_96a,NaN

In [4]:
df = df[['K. Stage Name', 'Date of Birth', 'Group', 'Height', 'Weight', 'Birthplace']]
df

   K. Stage Name Date of Birth    Group  Height  Weight Birthplace
15            소유    1992-02-12   SISTAR       0       0        NaN
16            다솜    1993-05-06   SISTAR       0       0        NaN
17            지현    1990-01-09  4minute     167       0      Seoul
18            가윤    1990-05-18  4minute     165       0      Seoul
19            지윤    1990-10-15  4minute     165       0      Seoul
20            현아    1992-06-06  4minute     164       0     Jeolla
21            소현    1994-08-30  4minute     162       0      Seoul
22            지민    1991-01-08      NaN     160      43      Seoul
23            초아    1990-03-06      NaN     160      42    Incheon
24            유나    1992-12-30      AoA     163      45      Busan
25            유경    1993-03-15      NaN     167      48        NaN
26            혜정    1993-08-10      AoA     170      48      Seoul
27            민아    1993-09-21      NaN     159      43      Busan
28            설현    1995-01-03      AoA     167      47    Bucheon
29            찬미    1996-06-19      AoA     166      47       Gumi

### 결측값 처리

- 결측값이란?
> - 자료가 입력되지 않은 값, 입력이 누락된 값을 의미 한다.
> - 현실의 거의 모든 데이터에는 결측값이 존재한다.
> - 결측값을 어떤 방식으로 처리하야냐에 따라 데이터 분석 결과가 달라질 수 있다.
> - `NaN, N/A, NULL, 0값`등 다양한 방식으로 불리고 있다.

> 1.데이터 탐색

In [17]:
df

   K. Stage Name Date of Birth    Group  Height  Weight Birthplace
15            소유    1992-02-12   SISTAR       0       0        NaN
16            다솜    1993-05-06   SISTAR       0       0        NaN
17            지현    1990-01-09  4minute     167       0      Seoul
18            가윤    1990-05-18  4minute     165       0      Seoul
19            지윤    1990-10-15  4minute     165       0      Seoul
20            현아    1992-06-06  4minute     164       0     Jeolla
21            소현    1994-08-30  4minute     162       0      Seoul
22            지민    1991-01-08      NaN     160      43      Seoul
23            초아    1990-03-06      NaN     160      42    Incheon
24            유나    1992-12-30      AoA     163      45      Busan
25            유경    1993-03-15      NaN     167      48        NaN
26            혜정    1993-08-10      AoA     170      48      Seoul
27            민아    1993-09-21      NaN     159      43      Busan
28            설현    1995-01-03      AoA     167      47    Bucheon
29            찬미    1996-06-19      AoA     166      47       Gumi

In [20]:
# 0 값을 NaN 형으로 변환 해준다. replace(x,y) = x를 y로 변환
df = df.replace(0, np.NaN)
df

   K. Stage Name Date of Birth    Group  Height  Weight Birthplace
15            소유    1992-02-12   SISTAR     NaN     NaN        NaN
16            다솜    1993-05-06   SISTAR     NaN     NaN        NaN
17            지현    1990-01-09  4minute   167.0     NaN      Seoul
18            가윤    1990-05-18  4minute   165.0     NaN      Seoul
19            지윤    1990-10-15  4minute   165.0     NaN      Seoul
20            현아    1992-06-06  4minute   164.0     NaN     Jeolla
21            소현    1994-08-30  4minute   162.0     NaN      Seoul
22            지민    1991-01-08      NaN   160.0    43.0      Seoul
23            초아    1990-03-06      NaN   160.0    42.0    Incheon
24            유나    1992-12-30      AoA   163.0    45.0      Busan
25            유경    1993-03-15      NaN   167.0    48.0        NaN
26            혜정    1993-08-10      AoA   170.0    48.0      Seoul
27            민아    1993-09-21      NaN   159.0    43.0      Busan
28            설현    1995-01-03      AoA   167.0    47.0    Bucheon
29            찬미    1996-06-19      AoA   166.0    47.0       Gumi

In [21]:
df.info()
# 유실 값이
'Group' = 4
'Height' = 2
'Weight' = 7
'Birthplace' = 3

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 15 to 29
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   K. Stage Name  15 non-null     object
 1   Date of Birth  15 non-null     object
 2   Group          11 non-null     object
 3   Height         13 non-null     float64
 4   Weight         8 non-null      float64
 5   Birthplace     12 non-null     object
dtypes: float64(2), object(4)
memory usage: 852.0+ bytes

> 2. 결측 데이터 확인 (`isnull`, `notnull()`)

In [23]:
df.isnull()
#true = null

    K. Stage Name  Date of Birth  Group  Height  Weight  Birthplace
15          False          False  False    True    True        True
16          False          False  False    True    True        True
17          False          False  False   False    True       False
18          False          False  False   False    True       False
19          False          False  False   False    True       False
20          False          False  False   False    True       False
21          False          False  False   False    True       False
22          False          False   True   False   False       False
23          False          False   True   False   False       False
24          False          False  False   False   False       False
25          False          False   True   False   False        True
26          False          False  False   False   False       False
27          False          False   True   False   False       False
28          False          False  False   False   False       False
29          False          False  False   False   False       False

In [24]:
df.notnull()
# false = NaN

    K. Stage Name  Date of Birth  Group  Height  Weight  Birthplace
15           True           True   True   False   False       False
16           True           True   True   False   False       False
17           True           True   True    True   False        True
18           True           True   True    True   False        True
19           True           True   True    True   False        True
20           True           True   True    True   False        True
21           True           True   True    True   False        True
22           True           True  False    True    True        True
23           True           True  False    True    True        True
24           True           True   True    True    True        True
25           True           True  False    True    True       False
26           True           True   True    True    True        True
27           True           True  False    True    True        True
28           True           True   True    True    True        True
29           True           True   True    True    True        True

In [27]:
df.isnull().sum()

K. Stage Name    0
Date of Birth    0
Group            4
Height           2
Weight           7
Birthplace       3
dtype: int64

> 결측 데이터 제거(`dropna()`)

In [28]:
# 기본적으로는 결측인 값이 존해하면 행 모두 삭제합니다.
df.dropna()
# 비추천 데이터 오류 발생 유발

   K. Stage Name Date of Birth Group  Height  Weight Birthplace
24            유나    1992-12-30   AoA   163.0    45.0      Busan
26            혜정    1993-08-10   AoA   170.0    48.0      Seoul
28            설현    1995-01-03   AoA   167.0    47.0    Bucheon
29            찬미    1996-06-19   AoA   166.0    47.0       Gumi

In [29]:
# subset=['column_name] 옵션을 지정하여 해당 컬럼만 검사한다.
# 'Group'의 NaN값 삭제
df.dropna(subset=['Group'])

   K. Stage Name Date of Birth    Group  Height  Weight Birthplace
15            소유    1992-02-12   SISTAR     NaN     NaN        NaN
16            다솜    1993-05-06   SISTAR     NaN     NaN        NaN
17            지현    1990-01-09  4minute   167.0     NaN      Seoul
18            가윤    1990-05-18  4minute   165.0     NaN      Seoul
19            지윤    1990-10-15  4minute   165.0     NaN      Seoul
20            현아    1992-06-06  4minute   164.0     NaN     Jeolla
21            소현    1994-08-30  4minute   162.0     NaN      Seoul
24            유나    1992-12-30      AoA   163.0    45.0      Busan
26            혜정    1993-08-10      AoA   170.0    48.0      Seoul
28            설현    1995-01-03      AoA   167.0    47.0    Bucheon
29            찬미    1996-06-19      AoA   166.0    47.0       Gumi

In [30]:
# subset= ['colum_name1', 'column_name2']
df.dropna(subset=['Group', 'Height'])

   K. Stage Name Date of Birth    Group  Height  Weight Birthplace
17            지현    1990-01-09  4minute   167.0     NaN      Seoul
18            가윤    1990-05-18  4minute   165.0     NaN      Seoul
19            지윤    1990-10-15  4minute   165.0     NaN      Seoul
20            현아    1992-06-06  4minute   164.0     NaN     Jeolla
21            소현    1994-08-30  4minute   162.0     NaN      Seoul
24            유나    1992-12-30      AoA   163.0    45.0      Busan
26            혜정    1993-08-10      AoA   170.0    48.0      Seoul
28            설현    1995-01-03      AoA   167.0    47.0    Bucheon
29            찬미    1996-06-19      AoA   166.0    47.0       Gumi

> 4-1 결측 데이터피치환(`fillna()`)
> - 결측 값을 대체해주는 함수입니다. `fillna('결측값을 대체할 값')` 형태로 사용할 수 있다.

In [5]:
df = df.dropna(subset=['Group'])
df

   K. Stage Name Date of Birth    Group  Height  Weight Birthplace
15            소유    1992-02-12   SISTAR       0       0        NaN
16            다솜    1993-05-06   SISTAR       0       0        NaN
17            지현    1990-01-09  4minute     167       0      Seoul
18            가윤    1990-05-18  4minute     165       0      Seoul
19            지윤    1990-10-15  4minute     165       0      Seoul
20            현아    1992-06-06  4minute     164       0     Jeolla
21            소현    1994-08-30  4minute     162       0      Seoul
24            유나    1992-12-30      AoA     163      45      Busan
26            혜정    1993-08-10      AoA     170      48      Seoul
28            설현    1995-01-03      AoA     167      47    Bucheon
29            찬미    1996-06-19      AoA     166      47       Gumi

In [6]:
# 지정 대체 값 대임
df['Height'] = df['Height'].fillna(160)
df

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

   K. Stage Name Date of Birth    Group  Height  Weight Birthplace
15            소유    1992-02-12   SISTAR       0       0        NaN
16            다솜    1993-05-06   SISTAR       0       0        NaN
17            지현    1990-01-09  4minute     167       0      Seoul
18            가윤    1990-05-18  4minute     165       0      Seoul
19            지윤    1990-10-15  4minute     165       0      Seoul
20            현아    1992-06-06  4minute     164       0     Jeolla
21            소현    1994-08-30  4minute     162       0      Seoul
24            유나    1992-12-30      AoA     163      45      Busan
26            혜정    1993-08-10      AoA     170      48      Seoul
28            설현    1995-01-03      AoA     167      47    Bucheon
29            찬미    1996-06-19      AoA     166      47       Gumi

> 평균값으로 대체 하기(많이 사용)

In [7]:
# 평균 값 대체 많이 사용
mean_value = df['Weight'].mean()
df['Weight'] = df['Weight'].fillna(mean_value)
df

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

   K. Stage Name Date of Birth    Group  Height  Weight Birthplace
15            소유    1992-02-12   SISTAR       0       0        NaN
16            다솜    1993-05-06   SISTAR       0       0        NaN
17            지현    1990-01-09  4minute     167       0      Seoul
18            가윤    1990-05-18  4minute     165       0      Seoul
19            지윤    1990-10-15  4minute     165       0      Seoul
20            현아    1992-06-06  4minute     164       0     Jeolla
21            소현    1994-08-30  4minute     162       0      Seoul
24            유나    1992-12-30      AoA     163      45      Busan
26            혜정    1993-08-10      AoA     170      48      Seoul
28            설현    1995-01-03      AoA     167      47    Bucheon
29            찬미    1996-06-19      AoA     166      47       Gumi

> 최빈값으로 대체
> - 값을 세어주는 함수 `value_counts()`을 활용한다.

In [36]:
df['Birthplace'].value_counts()

Seoul      5
Jeolla     1
Busan      1
Bucheon    1
Gumi       1
Name: Birthplace, dtype: int64

In [41]:
df['Birthplace'].value_counts().index[0]

'Seoul'

In [8]:
df['Birthplace'] = df['Birthplace'].fillna(df['Birthplace'].value_counts().index[0])
df

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

   K. Stage Name Date of Birth    Group  Height  Weight Birthplace
15            소유    1992-02-12   SISTAR       0       0      Seoul
16            다솜    1993-05-06   SISTAR       0       0      Seoul
17            지현    1990-01-09  4minute     167       0      Seoul
18            가윤    1990-05-18  4minute     165       0      Seoul
19            지윤    1990-10-15  4minute     165       0      Seoul
20            현아    1992-06-06  4minute     164       0     Jeolla
21            소현    1994-08-30  4minute     162       0      Seoul
24            유나    1992-12-30      AoA     163      45      Busan
26            혜정    1993-08-10      AoA     170      48      Seoul
28            설현    1995-01-03      AoA     167      47    Bucheon
29            찬미    1996-06-19      AoA     166      47       Gumi

> 5. `reset_index()`로 인덱스 재정렬
> - 결측치를 제거하거나, **전처리하는 과정에서 데터 프레임의 인덱스가 바뀌는 현상이 일어난다.**
> - 이때, `reset_index()`를 써서 마지막에 인덱스를 정렬 해준다.
> - 이후에 진행하게되는 분석과정에서 오류 발생률을 줄여준다.

In [9]:
# `drop= True` 옵션은 이전의 인덱스를 버린다.
# 'drop = False' 예전 인덱스 값을 새로운 column으로 편입시킨다.
df = df.reset_index(drop=True)
df

   K. Stage Name Date of Birth    Group  Height  Weight Birthplace
0             소유    1992-02-12   SISTAR       0       0      Seoul
1             다솜    1993-05-06   SISTAR       0       0      Seoul
2             지현    1990-01-09  4minute     167       0      Seoul
3             가윤    1990-05-18  4minute     165       0      Seoul
4             지윤    1990-10-15  4minute     165       0      Seoul
5             현아    1992-06-06  4minute     164       0     Jeolla
6             소현    1994-08-30  4minute     162       0      Seoul
7             유나    1992-12-30      AoA     163      45      Busan
8             혜정    1993-08-10      AoA     170      48      Seoul
9             설현    1995-01-03      AoA     167      47    Bucheon
10            찬미    1996-06-19      AoA     166      47       Gumi

### 중복값 처리

> 중복값이란?
> - 자료가 중복으로 입력된 값을 의미한다.
> - 전체 행/열이 중복된 경우, 혹은 값이 중복된 경우 가 있다.
> - 중복값을 어떤 방식으로 처리하느냐에 따라 데이터 분석 결과가 달라질 수 있다.

In [10]:
# 데이터 중복 값 만들기
df = df.append(df.iloc[-1]).reset_index(drop=True)
df

   K. Stage Name Date of Birth    Group  Height  Weight Birthplace
0             소유    1992-02-12   SISTAR       0       0      Seoul
1             다솜    1993-05-06   SISTAR       0       0      Seoul
2             지현    1990-01-09  4minute     167       0      Seoul
3             가윤    1990-05-18  4minute     165       0      Seoul
4             지윤    1990-10-15  4minute     165       0      Seoul
5             현아    1992-06-06  4minute     164       0     Jeolla
6             소현    1994-08-30  4minute     162       0      Seoul
7             유나    1992-12-30      AoA     163      45      Busan
8             혜정    1993-08-10      AoA     170      48      Seoul
9             설현    1995-01-03      AoA     167      47    Bucheon
10            찬미    1996-06-19      AoA     166      47       Gumi
11            찬미    1996-06-19      AoA     166      47       Gumi

> 1. 중복 데이터 탐색(`duplicated())
> - `duplicated() 함수는 행이 완벽히 중복된 여부를 감시 할 수있다.
> - 특정 열에 중복값이 있는지 확인을 할 수 도 있습니다.

In [11]:
# 중복된 행 찾기
df[df.duplicated()]

   K. Stage Name Date of Birth Group  Height  Weight Birthplace
11            찬미    1996-06-19   AoA     166      47       Gumi

In [12]:
# 맨 앞에 있는 값 =True 두 번째 값 부터 =False
df['Group'].duplicated()

0     False
1      True
2     False
3      True
4      True
5      True
6      True
7     False
8      True
9      True
10     True
11     True
Name: Group, dtype: bool

> **중복 데이터 제거 (`drop_duplicates()`)**

In [14]:
df.drop_duplicates()

   K. Stage Name Date of Birth    Group  Height  Weight Birthplace
0             소유    1992-02-12   SISTAR       0       0      Seoul
1             다솜    1993-05-06   SISTAR       0       0      Seoul
2             지현    1990-01-09  4minute     167       0      Seoul
3             가윤    1990-05-18  4minute     165       0      Seoul
4             지윤    1990-10-15  4minute     165       0      Seoul
5             현아    1992-06-06  4minute     164       0     Jeolla
6             소현    1994-08-30  4minute     162       0      Seoul
7             유나    1992-12-30      AoA     163      45      Busan
8             혜정    1993-08-10      AoA     170      48      Seoul
9             설현    1995-01-03      AoA     167      47    Bucheon
10            찬미    1996-06-19      AoA     166      47       Gumi

In [15]:
#특정 열을 기준으로 제거
#첫번쨰 기준 값만 출력
df.drop_duplicates(subset = ['Group'])

  K. Stage Name Date of Birth    Group  Height  Weight Birthplace
0            소유    1992-02-12   SISTAR       0       0      Seoul
2            지현    1990-01-09  4minute     167       0      Seoul
7            유나    1992-12-30      AoA     163      45      Busan

In [17]:
# 중복 값중 맨 뒤에 있는 값 적용
df.drop_duplicates(subset=['Group'], keep='last')

   K. Stage Name Date of Birth    Group  Height  Weight Birthplace
1             다솜    1993-05-06   SISTAR       0       0      Seoul
6             소현    1994-08-30  4minute     162       0      Seoul
11            찬미    1996-06-19      AoA     166      47       Gumi

## **apply, lamda, map 함수**

In [48]:
df = pd.read_csv('https://bit.ly/3gRXTfD')

In [49]:
df = df.loc[df['Gender']=='M'][:3].append(df.head(9)).reset_index(drop=True)

In [50]:
df = df[['Height', 'Weight', 'Gender']]
df

    Height  Weight Gender
0      180      65      M
1      174      56      M
2      177      58      M
3      160      44      F
4      158      43      F
5      163      50      F
6      158      48      F
7      167      45      F
8      170      48      F
9      166      47      F
10     168      48      F
11       0       0      F

### apply 함수

> - apply 함수는 데이터에 **구체적인 ㄹ직을 적용** 하고 싶을 경우 사용합니다.
> - **로직이 정의된 함수를 만들고, `apply()`함수에 대입합니다.**

In [51]:
def replace_zero(x):
    if x ==0:
        x = 165
    return x

In [52]:
df['Height'] = df['Height'].apply(replace_zero)
df

    Height  Weight Gender
0      180      65      M
1      174      56      M
2      177      58      M
3      160      44      F
4      158      43      F
5      163      50      F
6      158      48      F
7      167      45      F
8      170      48      F
9      166      47      F
10     168      48      F
11     165       0      F

### **lambda 함수**

> - lambda 함수는 apply에서 `def`정의된 함수와 동일한 기능을 합니다.
> - 다만, 한줄로 간편하게 작성할 수 있기 때문에 `def 함수영`, `return`등 복잡하게 작성하지 않아도 됩니다.
> - 로직이 복잡하지 않을 경우(사칙연산, 간단한 문자열 추출 등), 자주 사용하는 함수
> - 기본 사용법
    - `lambda '입력 변수' : '리턴값' 조건문(옵션)'`

In [53]:
# 값이 0일 경우 원하는 값으로 대체
df['Weight'] = df['Weight'].apply(lambda x:50 if x==0 else x)
#                                  x가 0이면 50으로 바꾼다/아니면 x는 유지
df

    Height  Weight Gender
0      180      65      M
1      174      56      M
2      177      58      M
3      160      44      F
4      158      43      F
5      163      50      F
6      158      48      F
7      167      45      F
8      170      48      F
9      166      47      F
10     168      48      F
11     165      50      F

In [54]:
df['Weight/Height'] = df.apply(lambda x : x['Weight']/x['Height'], axis=1)
df

    Height  Weight Gender  Weight/Height
0      180      65      M       0.361111
1      174      56      M       0.321839
2      177      58      M       0.327684
3      160      44      F       0.275000
4      158      43      F       0.272152
5      163      50      F       0.306748
6      158      48      F       0.303797
7      167      45      F       0.269461
8      170      48      F       0.282353
9      166      47      F       0.283133
10     168      48      F       0.285714
11     165      50      F       0.303030

### **map 함수***

> - 데이터 값을 측정한 값으로 매핑(mapping) 하고 싶은 경우 사용합니다.
> - 반복문을 작성하면서 값을 치환하는 것보다 효율적
> - 하나의 컬럼인, Series형으로 적용 가능
> - 기본 사용법
    - `df['컬럼명'].map('매핑 정보')`

In [55]:
map_info = {'M' : '남자', 
            'F' : '여자'}

In [61]:
df['Gender'] = df['Gender'].map(map_info)

In [62]:
df

    Height  Weight Gender  Weight/Height
0      180      65     남자       0.361111
1      174      56     남자       0.321839
2      177      58     남자       0.327684
3      160      44     여자       0.275000
4      158      43     여자       0.272152
5      163      50     여자       0.306748
6      158      48     여자       0.303797
7      167      45     여자       0.269461
8      170      48     여자       0.282353
9      166      47     여자       0.283133
10     168      48     여자       0.285714
11     165      50     여자       0.303030